[
  {
    "id": 1,
    "title": "Kpop & Jpop Music Network",
    "category": "Personal",
    "date": "2024",
    "priority": true,
    "image": "/images/kpop_jpop_network.png",
    "image_small": "/images_small/kpop_jpop_network.png",
    "technologies": "Next.js / D3js / Neo4j / OpenAI",
    "url": "https://music-graph-ui.vercel.app/dashboard",
    "description": "To easily find contextual info and compare the Korean and Japanese music scene, I created a search engine and results interface, which includes an interactive network visualization with timeline component. AI-driven Neo4j-backed search, alongside standard form submission to filter results based on user queries."
  },
  {
    "id": 2,
    "title": "Monsta Fungus Gallery",
    "category": "Personal",
    "date": "2023",
    "priority": true,
    "image": "/images/monsta_fungus.png",
    "image_small": "/images_small/monsta_fungus.png",
    "technologies": "Vue.js / PIXI.js",
    "url": "https://monsta-fungus-viewer.netlify.app/",
    "description": "I created a gallery of hundreds of images of my generative artworks to showcase their possible traits and structures. The web app, created with Vue.js and PIXI.js, has zoom, sort and filter features to aid exploration and observation. The images smoothly transition to their new positions upon interaction of the filter buttons at the top of the interface."
  },
  {
    "id": 3,
    "title": "Data Visualization Library",
    "category": "Work",
    "date": "2022",
    "priority": true,
    "image": "/images/biovitals-demo.jpeg",
    "image_small": "/images_small/biovitals-demo.jpeg",
    "technologies": "D3.js",
    "url": "",
    "description": ""
  },
  {
    "id": 4,
    "title": "COVID-19 Network",
    "category": "Work",
    "date": "2020",
    "priority": true,
    "image": "/images/covid_network.png",
    "image_small": "/images_small/covid_network.png",
    "technologies": "React / D3.js",
    "url": "http://covid19-singapore.s3-website-ap-southeast-1.amazonaws.com/",
    "description": "The graph network below use figures from a dataset of every confirmed COVID-19 case announced since January 24, 2020 when the country’s first case was reported, to March 23, 2020 The data tracks confirmed cases by gender, age, status, source of infection and other information published in case reports and official press releases from Singapore's Ministry of Health (MOH). I created an animation to track the growth and spread of COVID-19 cases over time, with the network helping to visualize the relationships between cases."
  },
  {
    "id": 5,
    "title": "FIFA 19 Analytics",
    "category": "Personal",
    "date": "2020",
    "priority": true,
    "image": "/images/fifa19_binned.png",
    "image_small": "/images_small/fifa19_binned.png",
    "technologies": "React / D3.js",
    "url": "http://fifa19-viz.s3-website-ap-southeast-1.amazonaws.com/",
    "description": "Detailed attributes for all 18,207 player registered in football simulation video game 'FIFA 19' is made available on the website sofifacom. Players are scored according to 6 categories representing their abilities. An overall score is formulated for each player based on these category scores (ie. sub-score) amongst other parameters. The challenge is to visualize the data attributes in intuitive and interactive way, while managing the information overload."
  },
  {
    "id": 6,
    "title": "Web3 Gaming Dashboard",
    "category": "Work",
    "date": "2024",
    "image": "/images/svelte_dashboard.png",
    "image_small": "/images_small/svelte_dashboard.png",
    "technologies": "Svelte / D3.js / Tailwind CSS",
    "url": "https://sveltekit-dashboard.netlify.app/total-active-user",
    "description": "Interactive dashboard with data that is filterable by date and region"
  },
  {
    "id": 7,
    "title": "Clinical Data Dashboard",
    "category": "Work",
    "date": "2023",
    "image": "/images/medical_dashboard.jpeg",
    "image_small": "/images_small/medical_dashboard.jpeg",
    "technologies": "D3.js",
    "url": "https://stiqi.netlify.app/",
    "description": "I worked together with a doctor, the subject matter expert, from January to July 2023 to bring his visual design of a dashboard displaying patients' health records to life, creating an interactive timeline visualization befitting of high dimensional medical data. This dashboard was meant to be eventually used by clinicians specialised in sexual health. The goal of the project is to transform the way medical data is currently presented, utilizing visualization techniques to represent complex information in a digestible graphical format to easily obtain insights, changes and patterns."
  },
  {
    "id": 8,
    "title": "VizForSocialGood Contributors Network",
    "category": "Social",
    "date": "2021",
    "image": "/images/vizforsocialgood-network.png",
    "image_small": "/images_small/vizforsocialgood-network.png",
    "technologies": "AntV G6",
    "url": "https://vizforsocialgood-network.netlify.app/",
    "description": "Helping Viz For Social Good (@VizFSG) visualise tracked volunteer contributions to all projects since 2017 with a network"
  },
  {
    "id": 9,
    "title": "d3-force Scrollytelling",
    "category": "Personal",
    "date": "2022",
    "image": "/images/d3-forces-collection.png",
    "image_small": "/images_small/d3-forces-collection.png",
    "technologies": "D3.js",
    "url": "https://d3-force-collection.netlify.app/",
    "description": "A compilation of d3-force simulations: their use cases and the creation methods behind them."
  },
  {
    "id": 10,
    "title": "Data Viz Society Survey",
    "category": "Social",
    "date": "2022",
    "image": "/images/data-visualizers.gif",
    "image_small": "/images/data-visualizers.gif",
    "technologies": "PIXI.js",
    "url": "https://data-visualizers.netlify.app/",
    "description": "The Data Visualization Society released their 2020 survey results and I participated in visualizing the results, choosing to represent all respondents as animating and interactive dots on the screen."
  },
  {
    "id": 11,
    "title": "Kiron",
    "category": "Social",
    "date": "2021",
    "image": "/images/kiron_full.png",
    "image_small": "/images_small/kiron_full.png",
    "technologies": "D3.js / GeoJSON",
    "url": "",
    "description": "Kiron Open Higher Education is a non-profit organization supporting access to higher education for refugees and asylum seekers. Kiron teamed up with VizForSocialGood in July 2019 to launch a data visualization hackathon and provided details (e.g., datasets, needs, goals). They wanted VizForSocialGood volunteers to illustrate the need of their work and why their mission of providing digital learning opportunities for academic, professional and personal growth is so important."
  },
  {
    "id": 12,
    "title": "Formula 1 Connections",
    "category": "Personal",
    "date": "2023",
    "image": "/images/f1-connections.png",
    "image_small": "/images_small/f1-connections.png",
    "technologies": "D3.js",
    "url": "https://f1-connections.netlify.app",
    "description": "A visual representation of Formula 1 drivers and their racing teams from 2000-2021 throught a web of connections created with D3.js"
  },
  {
    "id": 13,
    "title": "React Flow Flowchart Editor",
    "category": "Work",
    "date": "2024",
    "image": "/images/reactflow.png",
    "image_small": "/images_small/reactflow.png",
    "technologies": "React Flow",
    "url": "https://workflow-editor.netlify.app",
    "description": "A dynamic tool for visualizing and editing hierarchical workflows. Users can upload JSON files representing a flowchart, which the editor renders interactively. Alternatively, components representing nodes and edges can be dragged and dropped to create or modify the flowchart, enabling seamless customization and visualization"
  },
  {
    "id": 14,
    "title": "Financial Equities Network",
    "category": "Work",
    "date": "2024",
    "image": "/images/financial_network1.png",
    "image_small": "/images_small/financial_network.jpeg",
    "technologies": "D3.js",
    "url": "https://investment-kg.netlify.app/",
    "description": "I worked together with a domain expert to visualize hierarchical financial information of countries and equities in the form of a tree-based/bubble visualization. Based on the client's understanding of the context and types of questions users may have about the dataset, I designed and developed the search/interaction logic of the visualization, with a smooth transition effect between view states. Clicking on entities will reveal or hide child nodes layer by layer."
  },
  {
    "id": 15,
    "title": "A-VO-SP Map",
    "category": "Work",
    "date": "2023",
    "image": "/images/avosp.png",
    "image_small": "/images_small/avosp.png",
    "technologies": "React / D3.js",
    "url": "https://a-vo-sp.netlify.app",
    "description": "I built a web application for an academic research project concerning sustainability research. There are two goals to this interactive website, both built around a novel circular Research Map, which enables users to identify trends and gaps through filtering by various aspects (Year, Author, Journal Type, Dimensions). understand the research field better through visual representation on the Research Map. Secondly, users should be able to answer an embedded survey to place their own work/ideas on the Research Map. "
  },
  {
    "id": 16,
    "title": "International Futures",
    "category": "Work",
    "date": "2024",
    "image": "/images/ifs-network.png",
    "image_small": "/images_small/ifs-network.png",
    "technologies": "PIXI.js",
    "url": "https://ifs-network-demo.netlify.app/",
    "description": "I created a tool for a US-based research institute to visualize outputs of a mathematical model for long-term global trend analysis and forecasting in an interactive graph visualization with zoom/pan, search, filter and dynamic data update functionality. Entities on the graph can be clicked to expand (reveal child nodes belonging to a parent) or collapse subgraphs."
  },
  {
    "id": 17,
    "title": "Constituency Wards in Singapore",
    "category": "Personal",
    "date": "2024",
    "image": "/images/sgp-constituencies.png",
    "image_small": "/images_small/sgp-constituencies.png",
    "technologies": "D3.js",
    "url": "https://singapore-electoral-divisions.netlify.app/",
    "description": "How has Constituency Wards (Electoral Divisions) in Singapore changed? Curious about this during the last General Election in 2020, I created a map that shows how the boundaries of each ward have changed between elections using animated SVG shapes to represent them."
  }
]
